axf33480/ESP32CommandStation/src/Interfaces/WebServer.cpp
  BUILTIN_URI("/jquery.min.js")
  BUILTIN_URI("/jquery.mobile-1.5.0-rc1.min.js")
  BUILTIN_URI("/jquery.mobile-1.5.0-rc1.min.css")
  BUILTIN_URI("/jquery.simple.websocket.min.js")
  BUILTIN_URI("/jqClock-lite.min.js")
  BUILTIN_URI("/images/ajax-loader.gif")
  BUILTIN_URI("/index.html")

  GET_URI("/features", handleFeatures)
  GET_POST_URI("/programmer", handleProgrammer)
  GET_PUT_URI("/power", handlePower)
  GET_POST_URI("/config", handleConfig)
  GET_POST_PUT_DELETE_URI("/locomotive", handleLocomotive)
  GET_POST_PUT_DELETE_URI("/turnouts", handleTurnouts)
  POST_UPLOAD_URI("/update", handleOTA, otaUploadCallback)

#if ENABLE_OUTPUTS
  GET_POST_PUT_DELETE_URI("/outputs", handleOutputs)
#endif
#if ENABLE_SENSORS
  GET_POST_DELETE_URI("/sensors", handleSensors)
  GET_POST_DELETE_URI("/remoteSensors", handleRemoteSensors)
#if S88_ENABLED
  GET_POST_DELETE_URI("/s88sensors", handleS88Sensors)
#endif
#endif

  webServer.onNotFound(std::bind(&ESP32CSWebServer::notFoundHandler
                               , this
                               , std::placeholders::_1));

  webSocket.onEvent(handleWsEvent);
  webServer.addHandler(&webSocket);
  webServer.begin();
  mdns_->publish("websvr", "_http._tcp", 80);
}

void ESP32CSWebServer::handleProgrammer(AsyncWebServerRequest *request)
{
  if (request->method() == HTTP_GET)
  {
    if (request->arg(JSON_PROG_ON_MAIN).equalsIgnoreCase(JSON_VALUE_TRUE))
    {
      SEND_GENERIC_RESPONSE(request, STATUS_NOT_ALLOWED)
    }
    else if(request->hasArg(JSON_IDENTIFY_NODE))
    {
      int16_t decoderConfig = readCV(CV_NAMES::DECODER_CONFIG);
      uint16_t decoderAddress = 0;
      if (decoderConfig > 0)
      {
        string response = "{";
        if (bitRead(decoderConfig, DECODER_CONFIG_BITS::DECODER_TYPE))
        {
          uint8_t decoderManufacturer = readCV(CV_NAMES::DECODER_MANUFACTURER);
          int16_t addrMSB = readCV(CV_NAMES::ACCESSORY_DECODER_MSB_ADDRESS);
          int16_t addrLSB = readCV(CV_NAMES::SHORT_ADDRESS);
          if (addrMSB >= 0 && addrLSB >= 0)
          {
            if (decoderManufacturer == 0xA5)
            {
              // MERG uses 7 bit LSB
              decoderAddress = (uint16_t)(((addrMSB & 0x07) << 7) | (addrLSB & 0x7F));
            }
            else if(decoderManufacturer == 0x19)
            {
              // Team Digital uses 8 bit LSB and 4 bit MSB
              decoderAddress = (uint16_t)(((addrMSB & 0x0F) << 8) | addrLSB);
            }
            else
            {
              // NMRA spec shows 6 bit LSB
              decoderAddress = (uint16_t)(((addrMSB & 0x07) << 6) | (addrLSB & 0x1F));
            }
            response += StringPrintf("\"%s\":\"%s\",", JSON_ADDRESS_MODE_NODE
                                   , JSON_VALUE_LONG_ADDRESS);
          }
          else
          {
            LOG(WARNING, "Failed to read address MSB/LSB");
            SEND_GENERIC_RESPONSE(request, STATUS_SERVER_ERROR)
          }
        }
        else
        {
          if (bitRead(decoderConfig, DECODER_CONFIG_BITS::SHORT_OR_LONG_ADDRESS))
          {
            int16_t addrMSB = readCV(CV_NAMES::LONG_ADDRESS_MSB_ADDRESS);
            int16_t addrLSB = readCV(CV_NAMES::LONG_ADDRESS_LSB_ADDRESS);
            if (addrMSB >= 0 && addrLSB >= 0)
            {
              decoderAddress = (uint16_t)(((addrMSB & 0xFF) << 8) | (addrLSB & 0xFF));
              response += StringPrintf("\"%s\":\"%s\",", JSON_ADDRESS_MODE_NODE
                                     , JSON_VALUE_LONG_ADDRESS);

            }
            else
            {
              LOG(WARNING, "Unable to read address MSB/LSB");
              SEND_GENERIC_RESPONSE(request, STATUS_SERVER_ERROR)
            }
          }
          else
          {
            int16_t shortAddr = readCV(CV_NAMES::SHORT_ADDRESS);
            if (shortAddr > 0)
            {
              decoderAddress = shortAddr;
              response += StringPrintf("\"%s\":\"%s\",", JSON_ADDRESS_MODE_NODE
                                     , JSON_VALUE_SHORT_ADDRESS);
            }
            else
            {
              LOG(WARNING, "Unable to read short address CV");
              SEND_GENERIC_RESPONSE(request, STATUS_SERVER_ERROR)
            }
          }
          response += StringPrintf("\"%s\":%s,", JSON_SPEED_TABLE_NODE
                                 , bitRead(decoderConfig
                                         , DECODER_CONFIG_BITS::SPEED_TABLE) ?
                                           JSON_VALUE_ON : JSON_VALUE_OFF);
        }
        response += StringPrintf("\"%s\":%d,", JSON_ADDRESS_NODE
                               , decoderAddress);
        bool create = request->arg(JSON_CREATE_NODE).equalsIgnoreCase(JSON_VALUE_TRUE);
        // if it is a mobile decoder *AND* we are requested to create it, send
        // the decoder address to the train db to create an entry.
        if (create &&
           (decoderConfig & BIT(DECODER_CONFIG_BITS::DECODER_TYPE)) == 0)
        {
          auto traindb = Singleton<esp32cs::Esp32TrainDatabase>::instance();
          traindb->create_if_not_found(decoderAddress);
        }
        response += "}";
        SEND_JSON_RESPONSE(request, response)
      }
      else
      {
        LOG(WARNING, "Failed to read decoder configuration");
        SEND_GENERIC_RESPONSE(request, STATUS_SERVER_ERROR)
      }
    }
    else
    {
      uint16_t cvNumber = request->arg(JSON_CV_NODE).toInt();
      int16_t cvValue = readCV(cvNumber);
      if (cvValue < 0)
      {
        SEND_GENERIC_RESPONSE(request, STATUS_SERVER_ERROR)
      }
      SEND_JSON_RESPONSE(request
                       , StringPrintf("{\"%s\":%d,\"%s\":%d}"
                                    , JSON_CV_NODE, cvNumber
                                    , JSON_VALUE_NODE, cvValue))
    }
  }
  else if (request->method() == HTTP_POST && request->hasArg(JSON_PROG_ON_MAIN))
  {
    if (request->arg(JSON_PROG_ON_MAIN).equalsIgnoreCase(JSON_VALUE_TRUE))
    {
      if (request->hasArg(JSON_CV_BIT_NODE))
      {
        writeOpsCVBit(request->arg(JSON_ADDRESS_NODE).toInt(), request->arg(JSON_CV_NODE).toInt(),
          request->arg(JSON_CV_BIT_NODE).toInt(), request->arg(JSON_VALUE_NODE).equalsIgnoreCase(JSON_VALUE_TRUE));
      }
      else
      {
        writeOpsCVByte(request->arg(JSON_ADDRESS_NODE).toInt(), request->arg(JSON_CV_NODE).toInt(),
          request->arg(JSON_VALUE_NODE).toInt());
      }
    }
    else
    {
      if (request->hasArg(JSON_CV_BIT_NODE) &&
          !writeProgCVBit(request->arg(JSON_CV_NODE).toInt(), request->arg(JSON_CV_BIT_NODE).toInt(),
                          request->arg(JSON_VALUE_NODE).equalsIgnoreCase(JSON_VALUE_TRUE)))
      {
        SEND_GENERIC_RESPONSE(request, STATUS_SERVER_ERROR)
      }
      else if (!writeProgCVByte(request->arg(JSON_CV_NODE).toInt(), request->arg(JSON_VALUE_NODE).toInt()))
      {
        SEND_GENERIC_RESPONSE(request, STATUS_SERVER_ERROR)
      }
    }
  }
  SEND_GENERIC_RESPONSE(request, STATUS_OK)
 }

void ESP32CSWebServer::handlePower(AsyncWebServerRequest *request)
{
  if (request->method() == HTTP_GET)
  {
    if (request->params())
    {
      SEND_JSON_RESPONSE(request
                       , StringPrintf("{\"%s\":\"%s\"}"
                                    , JSON_STATE_NODE
                                    , trackSignal->is_enabled() ?
                                        JSON_VALUE_TRUE : JSON_VALUE_FALSE));
    }
    else
    {
      SEND_JSON_RESPONSE(request, trackSignal->generate_status_json())
    }
    return;
  }
  else if (request->method() == HTTP_PUT)
  {
    if (request->arg(JSON_STATE_NODE).equalsIgnoreCase(JSON_VALUE_TRUE))
    {
      trackSignal->enable_ops_output();
    }
    else
    {
      trackSignal->disable_ops_output();
      trackSignal->disable_prog_output();
    }
    SEND_GENERIC_RESPONSE(request, STATUS_OK)
    return;
  }
  SEND_GENERIC_RESPONSE(request, STATUS_BAD_REQUEST)
 }

void ESP32CSWebServer::handleOutputs(AsyncWebServerRequest *request)
{
#if ENABLE_OUTPUTS
  if (request->method() == HTTP_GET && !request->hasArg(JSON_ID_NODE))
  {
    SEND_JSON_RESPONSE(request, OutputManager::getStateAsJson())
  }
  else if (request->method() == HTTP_GET)
  {
    auto output = OutputManager::getOutput(request->arg(JSON_ID_NODE).toInt());
    SEND_JSON_IF_OBJECT_ARG(request, output, true)
  }
  else if (request->method() == HTTP_POST)
  {
    uint16_t outputID = request->arg(JSON_ID_NODE).toInt();
    uint8_t pin = request->arg(JSON_PIN_NODE).toInt();
    bool inverted = request->arg(JSON_INVERTED_NODE).equalsIgnoreCase(JSON_VALUE_TRUE);
    bool forceState = request->arg(JSON_FORCE_STATE_NODE).equalsIgnoreCase(JSON_VALUE_TRUE);
    bool defaultState = request->arg(JSON_DEFAULT_STATE_NODE).equalsIgnoreCase(JSON_VALUE_TRUE);
    uint8_t outputFlags = 0;
    if (inverted)
    {
      bitSet(outputFlags, OUTPUT_IFLAG_INVERT);
    }
    if (forceState)
    {
      bitSet(outputFlags, OUTPUT_IFLAG_RESTORE_STATE);
      if (defaultState)
      {
        bitSet(outputFlags, OUTPUT_IFLAG_FORCE_STATE);
      }
    }
    if (!OutputManager::createOrUpdate(outputID, pin, outputFlags))
    {
      SEND_GENERIC_RESPONSE(request, STATUS_NOT_ALLOWED)
    }
  }
  else if (request->method() == HTTP_DELETE &&
          !OutputManager::remove(request->arg(JSON_ID_NODE).toInt()))
  {
    SEND_GENERIC_RESPONSE(request, STATUS_NOT_FOUND)
  }
  else if(request->method() == HTTP_PUT)
  {
   OutputManager::toggle(request->arg(JSON_ID_NODE).toInt());
  }
  SEND_GENERIC_RESPONSE(request, STATUS_OK)
#endif // ENABLE_OUTPUTS
}

void ESP32CSWebServer::handleTurnouts(AsyncWebServerRequest *request)
{
  // GET /turnouts - full list of turnouts, note that turnout state is STRING type for display
  // GET /turnouts?readbleStrings=[0,1] - full list of turnouts, turnout state will be returned as true/false (boolean) when readableStrings=0.
  // GET /turnouts?address=<address> - retrieve turnout by DCC address
  // GET /turnouts?id=<id> - retrieve turnout by ID
  // PUT /turnouts?address=<address> - toggle turnout by DCC address
  // PUT /turnouts?id=<id> - toggle turnout by ID
  // POST /turnouts?id=<id>&address=<address>&subAddress=<subAddress>&type=<type> - creates a new turnout
  //      when id is -1 it will be auto-assigned as number of defined turnouts + 1.
  //      if subAddress is -1 the turnout will be defined as DCC address only.
  // DELETE /turnouts?id=<id> - delete turnout by ID
  // DELETE /turnouts?address=<address> - delete turnout by DCC address
  //
  // For successful requests the result code will be 200 and either an array of turnouts or single turnout will be returned.
  // For unsuccessful requests the result code will be 400 (bad request, missing args), 401 (not found), 500 (server failure).
  //

  if (request->method() == HTTP_GET && !request->hasArg(JSON_ID_NODE))
  {
    bool readableStrings = true;
    if (request->hasArg(JSON_TURNOUTS_READABLE_STRINGS_NODE))
    {
      readableStrings = request->arg(JSON_TURNOUTS_READABLE_STRINGS_NODE).toInt();
    }
    SEND_JSON_RESPONSE(request, turnoutManager->getStateAsJson(readableStrings))
  }
  else if (request->method() == HTTP_GET)
  {
    if(request->hasArg(JSON_ID_NODE))
    {
      auto turnout = turnoutManager->getTurnoutByID(request->arg(JSON_ID_NODE).toInt());
      SEND_JSON_IF_OBJECT(request, turnout)
    }
    else if (request->hasArg(JSON_ADDRESS_NODE))
    {
      auto turnout = turnoutManager->getTurnoutByID(request->arg(JSON_ADDRESS_NODE).toInt());
      SEND_JSON_IF_OBJECT(request, turnout)
    }
    else
    {
      SEND_GENERIC_RESPONSE(request, STATUS_BAD_REQUEST)
    }
  }
  else if (request->method() == HTTP_POST)
  {
    int32_t turnoutID = request->arg(JSON_ID_NODE).toInt();
    uint16_t turnoutAddress = request->arg(JSON_ADDRESS_NODE).toInt();
    int8_t turnoutSubAddress = request->arg(JSON_SUB_ADDRESS_NODE).toInt();
    TurnoutType type = (TurnoutType)request->arg(JSON_TYPE_NODE).toInt();
    // auto generate ID
    if (turnoutID == -1)
    {
      turnoutID = turnoutManager->getTurnoutCount() + 1;
    }
    auto turnout = turnoutManager->createOrUpdate((uint16_t)turnoutID, turnoutAddress, turnoutSubAddress, type);
    SEND_JSON_IF_OBJECT(request, turnout)
  }
  else if (request->method() == HTTP_DELETE)
  {
    if (request->hasArg(JSON_ID_NODE))
    {
      turnoutManager->removeByID(request->arg(JSON_ID_NODE).toInt());
    }
    else if (request->hasArg(JSON_ADDRESS_NODE))
    {
      turnoutManager->removeByAddress(request->arg(JSON_ADDRESS_NODE).toInt());
    }
    else
    {
      SEND_GENERIC_RESPONSE(request, STATUS_BAD_REQUEST)
    }
  }
  else if (request->method() == HTTP_PUT)
  {
    if (request->hasArg(JSON_ID_NODE))
    {
      turnoutManager->toggleByID(request->arg(JSON_ID_NODE).toInt());
    }
    else if (request->hasArg(JSON_ADDRESS_NODE))
    {
      turnoutManager->toggleByAddress(request->arg(JSON_ADDRESS_NODE).toInt());
    }
    else
    {
      SEND_GENERIC_RESPONSE(request, STATUS_BAD_REQUEST)
    }
  }
  SEND_GENERIC_RESPONSE(request, STATUS_OK)
}

void ESP32CSWebServer::handleSensors(AsyncWebServerRequest *request)
{
#if ENABLE_SENSORS
  if (request->method() == HTTP_GET && !request->hasArg(JSON_ID_NODE))
  {
    SEND_JSON_RESPONSE(request, SensorManager::getStateAsJson())
    return;
  }
  else if (request->method() == HTTP_GET)
  {
    auto sensor = SensorManager::getSensor(request->arg(JSON_ID_NODE).toInt());
    SEND_JSON_IF_OBJECT(request, sensor)
  }
  else if(request->method() == HTTP_POST)
  {
    uint16_t sensorID = request->arg(JSON_ID_NODE).toInt();
    uint8_t sensorPin = request->arg(JSON_PIN_NODE).toInt();
    bool sensorPullUp = request->arg(JSON_PULLUP_NODE).equalsIgnoreCase(JSON_VALUE_TRUE);
    if(!SensorManager::createOrUpdate(sensorID, sensorPin, sensorPullUp))
    {
      SEND_GENERIC_RESPONSE(request, STATUS_NOT_ALLOWED)
    }
  }
  else if(request->method() == HTTP_DELETE)
  {
    uint16_t sensorID = request->arg(JSON_ID_NODE).toInt();
    if(SensorManager::getSensorPin(sensorID) < 0)
    {
      // attempt to delete S88/RemoteSensor
      SEND_GENERIC_RESPONSE(request, STATUS_NOT_ALLOWED)
    }
    else if(!SensorManager::remove(sensorID))
    {
      SEND_GENERIC_RESPONSE(request, STATUS_NOT_FOUND)
    }
  }
  SEND_GENERIC_RESPONSE(request, STATUS_OK)
#endif // ENABLE_SENSORS
}

