axf33480/ESP32CommandStation/src/Interfaces/WebServer.cpp
void to_json(nlohmann::json& j, const wifi_ap_record_t& t)
{
  j = nlohmann::json({
    { JSON_WIFI_SSID_NODE, (char *)t.ssid },
    { JSON_WIFI_RSSI_NODE, t.rssi },
    { JSON_WIFI_AUTH_NODE, t.authmode },
  });
}

void ESP32CSWebServer::handleConfig(AsyncWebServerRequest *request)
{
  bool needReboot = false;
  if (request->hasArg("persist"))
  {
    DCCPPProtocolHandler::getCommandHandler("E")->process(vector<string>());
  }
  else if (request->hasArg("clear"))
  {
    DCCPPProtocolHandler::getCommandHandler("e")->process(vector<string>());
  }
  else if (request->hasArg("reset"))
  {
    configStore->factory_reset();
    needReboot = true;
  }
  else if (request->hasArg("scan"))
  {
    SyncNotifiable n;
    wifiManager->start_ssid_scan(&n);
    n.wait_for_notification();
    size_t num_found = wifiManager->get_ssid_scan_result_count();
    nlohmann::json ssid_list;
    vector<string> seen_ssids;
    for (int i = 0; i < num_found; i++)
    {
      auto entry = wifiManager->get_ssid_scan_result(i);
      if (std::find_if(seen_ssids.begin(), seen_ssids.end()
        , [entry](string &s)
          {
            return s == (char *)entry.ssid;
          }) != seen_ssids.end())
      {
        // filter duplicate SSIDs
        continue;
      }
      seen_ssids.push_back((char *)entry.ssid);
      ssid_list.push_back(entry);
    }
    wifiManager->clear_ssid_scan_results();
    SEND_JSON_RESPONSE(request, ssid_list.dump())
  }
  if (request->hasArg("ssid"))
  {
    // Setting the WiFi SSID will always require a restart as this is
    // configured when the Esp32WiFiManager is constructed.
    configStore->setWiFiStationParams(request->arg("ssid").c_str()
                                    , request->arg("password").c_str());
    needReboot = true;
  }
  if (request->hasArg("mode"))
  {
    needReboot |= configStore->setWiFiMode(request->arg("mode").c_str());
  }
  if (request->hasArg("nodeid"))
  {
    needReboot |= configStore->setNodeID(request->arg("nodeid").c_str());
  }
  if (request->hasArg("lcc-can"))
  {
    needReboot |= configStore->setLCCCan(request->arg("lcc-can").equalsIgnoreCase("true"));
  }
  /*if (request->hasArg("lcc-hub"))
  {
    configStore->setLCCHub(request->arg("lcc-hub").equalsIgnoreCase("true"));
  }*/
  if (request->hasArg("uplink-mode") && request->hasArg("uplink-service") &&
      request->hasArg("uplink-manual") && request->hasArg("uplink-manual-port"))
  {
    // WiFi uplink settings do not require a reboot
    configStore->setWiFiUplinkParams((SocketClientParams::SearchMode)request->arg("uplink-mode").toInt()
                                    , request->arg("uplink-service").c_str()
                                    , request->arg("uplink-manual").c_str()
                                    , request->arg("uplink-manual-port").toInt());
  }
  if (request->hasArg("ops-short") && request->hasArg("ops-short-clear") &&
      request->hasArg("ops-shutdown") && request->hasArg("ops-shutdown-clear") &&
      request->hasArg("ops-thermal") && request->hasArg("ops-thermal-clear"))
  {
    configStore->setHBridgeEvents(OPS_CDI_TRACK_OUTPUT_INDEX
                                , request->arg("ops-short").c_str()
                                , request->arg("ops-short-clear").c_str()
                                , request->arg("ops-shutdown").c_str()
                                , request->arg("ops-shutdown-clear").c_str()
                                , request->arg("ops-thermal").c_str()
                                , request->arg("ops-thermal-clear").c_str());
  }
  if (request->hasArg("prog-short") && request->hasArg("prog-short-clear") &&
      request->hasArg("prog-shutdown") && request->hasArg("prog-shutdown-clear"))
  {
    configStore->setHBridgeEvents(PROG_CDI_TRACK_OUTPUT_INDEX
                                , request->arg("prog-short").c_str()
                                , request->arg("prog-short-clear").c_str()
                                , request->arg("prog-shutdown").c_str()
                                , request->arg("prog-shutdown-clear").c_str());
  }

  if (needReboot)
  {
    // send a string back to the client rather than SEND_GENERIC_RESPONSE
    // so we don't return prior to calling reboot.
    SEND_TEXT_RESPONSE(request, STATUS_OK, "{restart:\"ESP32CommandStation Restarting!\"}")
    reboot();
  }

  SEND_JSON_RESPONSE(request, configStore->getCSConfig())
}

#if S88_ENABLED && ENABLE_SENSORS
void ESP32CSWebServer::handleS88Sensors(AsyncWebServerRequest *request)
{
  if(request->method() == HTTP_GET)
  {
    SEND_JSON_RESPONSE(request, S88BusManager::getStateAsJson())
  }
  else if(request->method() == HTTP_POST)
  {
    if(!S88BusManager::createOrUpdateBus(
      request->arg(JSON_ID_NODE).toInt(),
      request->arg(JSON_PIN_NODE).toInt(),
      request->arg(JSON_COUNT_NODE).toInt()))
    {
      // duplicate pin/id
      SEND_GENERIC_RESPONSE(request, STATUS_NOT_ALLOWED)
    }
  }
  else if(request->method() == HTTP_DELETE)
  {
    S88BusManager::removeBus(request->arg(JSON_ID_NODE).toInt());
  }
  SEND_GENERIC_RESPONSE(request, STATUS_OK)
}
#endif

void ESP32CSWebServer::handleRemoteSensors(AsyncWebServerRequest *request) {
#if ENABLE_SENSORS
  if(request->method() == HTTP_GET)
  {
    SEND_JSON_RESPONSE(request, RemoteSensorManager::getStateAsJson())
  }
  else if(request->method() == HTTP_POST)
  {
    RemoteSensorManager::createOrUpdate(request->arg(JSON_ID_NODE).toInt(),
      request->arg(JSON_VALUE_NODE).toInt());
  }
  else if(request->method() == HTTP_DELETE)
  {
    RemoteSensorManager::remove(request->arg(JSON_ID_NODE).toInt());
  }
  SEND_GENERIC_RESPONSE(request, STATUS_OK)
#endif // ENABLE_SENSORS
}

string convert_loco_to_json(TrainImpl *t)
{
  if (!t)
  {
    return "{}";
  }
  nlohmann::json j =
  {
    { JSON_ADDRESS_NODE, t->legacy_address() },
    { JSON_SPEED_NODE, t->get_speed().get_dcc_128() & 0x7F },
    { JSON_DIRECTION_NODE, t->get_speed().direction() ? JSON_VALUE_REVERSE : JSON_VALUE_FORWARD},
  };
  for(uint8_t funcID = 0; funcID < DCC_MAX_FN; funcID++)
  {
    j[JSON_FUNCTIONS_NODE].push_back({
      { JSON_ID_NODE, funcID },
      { JSON_STATE_NODE, t->get_fn(funcID) }
    });
  }
  return j.dump();
}

#define DELETE_LOCO_VIA_EXECUTOR(address, wait)             \
{                                                           \
  SyncNotifiable n;                                         \
  extern unique_ptr<OpenMRN> openmrn;                       \
  openmrn->stack()->executor()->add(new CallbackExecutable( \
    [&]()                                                   \
    {                                                       \
      trainNodes->remove_train_impl(address);               \
      if (wait)                                             \
      {                                                     \
        n.notify();                                         \
      }                                                     \
    }));                                                    \
    if (wait)                                               \
    {                                                       \
    n.wait_for_notification();                              \
    }                                                       \
}

#define GET_LOCO_VIA_EXECUTOR(NAME, address)                                          \
  TrainImpl *NAME = nullptr;                                                          \
  {                                                                                   \
    SyncNotifiable n;                                                                 \
    extern unique_ptr<OpenMRN> openmrn;                                               \
    openmrn->stack()->executor()->add(new CallbackExecutable(                         \
    [&]()                                                                             \
    {                                                                                 \
      NAME = trainNodes->get_train_impl(commandstation::DccMode::DCC_128_LONG_ADDRESS \
                                      , address);                                     \
      n.notify();                                                                     \
    }));                                                                              \
    n.wait_for_notification();                                                        \
  }

void ESP32CSWebServer::handleLocomotive(AsyncWebServerRequest *request)
{
  // method - url pattern - meaning
  // ANY /locomotive/estop - send emergency stop to all locomotives
  // GET /locomotive/roster - roster
  // GET /locomotive/roster?address=<address> - get roster entry
  // PUT /locomotive/roster?address=<address> - update roster entry
  // POST /locomotive/roster?address=<address> - create roster entry
  // DELETE /locomotive/roster?address=<address> - delete roster entry
  // GET /locomotive - get active locomotives
  // POST /locomotive?address=<address> - add locomotive to active management
  // GET /locomotive?address=<address> - get locomotive state
  // PUT /locomotive?address=<address>&speed=<speed>&dir=[FWD|REV]&fX=[true|false] - Update locomotive state, fX is short for function X where X is 0-28.
  // DELETE /locomotive?address=<address> - removes locomotive from active management
  string url(request->url().c_str());
  auto traindb = Singleton<esp32cs::Esp32TrainDatabase>::instance();

  // check if we have an eStop command, we don't care how this gets sent to the
  // command station (method) so check it first
  if(url.find("/estop") != string::npos)
  {
    Singleton<esp32cs::EStopHandler>::instance()->set_state(true);
  }
  else if(url.find("/roster")  != string::npos)
  {
    if(request->method() == HTTP_GET && !request->hasArg(JSON_ADDRESS_NODE))
    {
      SEND_JSON_RESPONSE(request,
                         Singleton<esp32cs::Esp32TrainDatabase>::instance()->get_all_entries_as_json())
    }
    else if (request->hasArg(JSON_ADDRESS_NODE))
    {
      if(request->method() == HTTP_DELETE)
      {
        traindb->delete_entry(request->arg(JSON_ADDRESS_NODE).toInt());
        SEND_GENERIC_RESPONSE(request, STATUS_OK)
      }
      else
      {
        uint16_t address = request->arg(JSON_ADDRESS_NODE).toInt();
        traindb->create_if_not_found(address);
        if(request->method() == HTTP_PUT || request->method() == HTTP_POST)
        {
          if(request->hasArg(JSON_NAME_NODE))
          {
            string name = request->arg(JSON_NAME_NODE).c_str();
            traindb->set_train_name(address, name);
          }
          if(request->hasArg(JSON_IDLE_ON_STARTUP_NODE))
          {
            bool idle = request->arg(JSON_IDLE_ON_STARTUP_NODE).equalsIgnoreCase(JSON_VALUE_TRUE);
            traindb->set_train_auto_idle(address, idle);
          }
          if(request->hasArg(JSON_DEFAULT_ON_THROTTLE_NODE))
          {
            bool show = request->arg(JSON_DEFAULT_ON_THROTTLE_NODE).equalsIgnoreCase(JSON_VALUE_TRUE);
            traindb->set_train_show_on_limited_throttle(address, show);
          }
        }
        SEND_JSON_RESPONSE(request, traindb->get_entry_as_json(address));
      }
    }
  }
  else
  {
    // Since it is not an eStop or roster command we need to check the request
    // method and ensure it contains the required arguments otherwise the
    // request should be rejected
    if(request->method() == HTTP_GET && !request->hasArg(JSON_ADDRESS_NODE))
    {
      // get all active locomotives
      string res = "[";
      for (size_t id = 0; id < trainNodes->size(); id++)
      {
        auto nodeid = trainNodes->get_train_node_id(id);
        if (nodeid)
        {
          auto loco = trainNodes->get_train_impl(nodeid);
          res += convert_loco_to_json(loco);
          res += ",";
        }
      }
      res += "]";
      SEND_JSON_RESPONSE(request, res)
    }
    else if (request->hasArg(JSON_ADDRESS_NODE))
    {
      uint16_t address = request->arg(JSON_ADDRESS_NODE).toInt();
      if(request->method() == HTTP_PUT || request->method() == HTTP_POST)
      {
        GET_LOCO_VIA_EXECUTOR(loco, address);
        auto upd_speed = loco->get_speed();
        // Creation / Update of active locomotive
        if(request->hasArg(JSON_IDLE_NODE))
        {
          upd_speed.set_dcc_128(0);
        }
        if(request->hasArg(JSON_SPEED_NODE))
        {
          upd_speed.set_dcc_128(request->arg(JSON_SPEED_NODE).toInt());
        }
        if(request->hasArg(JSON_DIRECTION_NODE))
        {
          bool forward =
            request->arg(JSON_DIRECTION_NODE).equalsIgnoreCase(JSON_VALUE_FORWARD);
          upd_speed.set_direction(forward ? dcc::SpeedType::FORWARD
                                          : dcc::SpeedType::REVERSE);
        }
        loco->set_speed(upd_speed);
        for(uint8_t funcID = 0; funcID <=28 ; funcID++)
        {
          string fArg = StringPrintf("f%d", funcID);
          if(request->hasArg(fArg.c_str()))
          {
            loco->set_fn(funcID, request->arg(fArg.c_str()).equalsIgnoreCase(JSON_VALUE_TRUE));
          }
        }
        SEND_JSON_RESPONSE(request, convert_loco_to_json(loco))
      }
      else if(request->method() == HTTP_DELETE)
      {
        DELETE_LOCO_VIA_EXECUTOR(address, false);
#if NEXTION_ENABLED
        static_cast<NextionThrottlePage *>(nextionPages[THROTTLE_PAGE])->invalidateLocomotive(address);
#endif
        SEND_GENERIC_RESPONSE(request, STATUS_OK)
      }
      else
      {
        GET_LOCO_VIA_EXECUTOR(loco, address);
        SEND_JSON_RESPONSE(request, convert_loco_to_json(loco))
      }
    }
  }
  // missing arg or unknown request
  SEND_GENERIC_RESPONSE(request, STATUS_BAD_REQUEST)
}

